onemeterplate_coarse/pimpleDyMFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          160;
        startFace       155835;
    }
    inlet
    {
        type            patch;
        nFaces          182;
        startFace       155995;
    }
    outlet
    {
        type            patch;
        nFaces          182;
        startFace       156177;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          84;
        startFace       156359;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          77765;
        startFace       156443;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          77765;
        startFace       234208;
    }
)

// ************************************************************************* //
